- **[필수] 데이터베이스 언어(SQL)** 분류
    
    👉 SQL 문법들은 목적에 따라 크게 세 가지 언어로 나뉩니다. 각 언어의 **정의, 대표적인 명령어(*ex: SELECT, INSERT, CREATE 등*), 그리고 실제 어떤 상황에 쓰이는 지** 정리해 주세요.
    
    - DQL : 데이터 질의 언어 / SELECT / (가끔 SELECT를 DML으로 분류하기도 함)
    * SELECT 데이터베이스에서 원하는 데이터를 찾고 필터링하고 원하는 데이터값을 계산하기 위해 쓰인다.
    - DML : 데이터 조작 언어 / INSERT , UPDATE, DELETE  , MERGE/
    주로 데이터를 추가, 수정, 삭제를 할 때 사용한다
    * INSERT INTO 테이블명 VALUES(값, 값, 값, 값 ..) 처럼 테이블 내 모든 컬럼에 해당하는 속성값을 다 입력해서 값을 집어 넣거나
    INSERT INTO 테이블명(컬럼명, 컬럼명,…) VALUES (값, 값, 값…..) 처럼 컬럼에 해당하는 값만 지정해서 넣는 식으로 테이블에 인스턴스를 추가해 줄 수 있다.
    
    *UPDATE 테이블명 SET 컬럼명 값 의 형식으로 테이블에 이미 존재하고 있던 속성값을 수정해 줄 수 있다.
    
    *DELETE 테이블명 [WHERE 조건] 으로 원하는 조건에 해당하는 인스턴스의 값을 지워줄 수 있고 조건을 설정하지 않으면 테이블의 구조는 남겨둔 채 데이터만 지운다.
    
    *MERGE 데이터가 없으면 추가 / 있으면 수정
    - DDL : 데이터 정의 언어 / CREATE, ALTER, DROP, TRUNCATE /
    주로 객체를 생성하거나 구조를 변경하거나 지울 때 사용한다.
    *CREATE 테이블이나 VIEW, SEQUENCE, PROCEDURE 등의 객체를 생성할 수 있다.
    CREATE TABLE 테이블명 (
    컬럼명 데이터타입,
    컬럼명 데이터타입
    …
    ); 형식으로 테이블을 만들거나
    
    CREATE VIEW 뷰명
    AS
    서브쿼리 로 가상의 테이블 등의 역할을 하는 VIEW를 만들거나
    
    CREATE SEQUENCE 시퀀스명
    [START WITH 숫자]
    [INCREMENT BY 숫자]
    [MAXVALUE 숫자]
    [MINVALUE 숫자]
    [REVERSED ] 등의 자동으로 일련번호를 생성해주는 시퀀스나
    
    CREATE PROCEDURE 프로시져명
    (변수명 데이터타입 IN|OUT|INOUT, 
    변수명 데이터타입 IN|OUT|INOUT,
    …
    )
    IS
    BEGIN
     실행할 내용
    [EXCEPTION]  의 형태로 반복되는 작업을 단순화 시켜줄 프로시져라던가 여러 객체를 만들 때 사용한다.
    
    * ALTER 테이블명 ADD 칼럼명 - 칼럼이나 제약조건 등을 추가할 때 사용
     ALTER 테이블명 MODIFY 칼럼명 - 칼럼이나 제약 조건 등을 수정할 때 사용 ( 제약 조건은 보통 삭제 - 추가를 하는 편)
    ALTER 테이블명 DROP COLUMN 칼럼명 - 칼럼이나 제약조건등을 삭제할 때 사용
    
    * DROP 테이블명 - 테이블을 지운다
    DROP 테이블명.제약조건명 - 해당하는 제약조건을 지운다
    
    * TRUNCATE - 구조를 남겨둔 채 지운다 // DELETE 와 차이점은 DDL 은 실행 후 자동으로 COMMIT을 실행하기 때문에 ROLLBACK을 할 수 없다.
- **[선택]** 테이블을 왜 분리해야 하는가? (생각 정리해보기)
    - 다음 상황을 읽어보고, 각자의 생각을 자유롭게 정리해보기
    - **상황**: 하나의 ‘주문 테이블’에 [고객 이름, 연락처, 주문 상품, 가격, 배송지]를 모두 몰아서 저장하고 있습니다.
    - **생각해볼 부분**:
        1. 한 고객이 이사를 가거나 전화번호를 바꾸면 어떤 번거로운 일이 생길까?
        
        수정하기 위해 모든 정보를 불러와야한다. 지금은 정보가 적지만 항목이 많아질 수록 부담이 커진다.
        → 여러 곳에 중복 저장되어 있으면 각 ROW마다 수정해줘야하고 실수로 놓칠 경우 일치성이 깨지는 수정 이상이 발생한다.
        
        2. 아직 상품을 한 번도 주문하지 않은 신규 가입 회원의 정보는 이 테이블에 저장할 수 있을까?
        NOT NULL 제약 조건이 있는 항목이 있다면 저장할 수 없다.
        → NOT NULL이 없더라도 NULL 값을 넣어야해서 데이터의 무결성이 저해되는 삽입 이상이 발생한다.
        
        3. 이 문제를 해결하려면 테이블을 어떻게 나누는 것이 좋을까? 
        (가볍게 글로 설명하거나 그림으로 그려보아도 좋습니다.)
        
        고객 테이블 / 상품 테이블 / 주문 테이블로 분할하기!
        고객 테이블 (회원번호(PK), 고객 이름, 연락처)
        상품 테이블 (상품번호(PK), 가격)
        주문 테이블 (거래번호(PK), 회원번호(FK), 상품번호(FK), 수량, 배송지)
        
    
    👉 이러한 고민 과정을 데이터베이스에서는 **정규화(Normalization)** 라고 부릅니다. 이 키워드를 가볍게 검색해 보며 자신의 생각과 비교해 보세요.
    
    정규화 이전
    [고객 이름, 연락처, 주문 상품, 가격, 배송지]
    
    1차 정규화
    고객이 주문 상품을 하나만 주문하진 않았을테니 원자값으로 만들어주기 위해 주문상품별로 떼어낸다
    [회원번호(PK), 고객이름 , 연락처, 상품번호(PK),  상품이름 , 가격,  배송지] //
    
    2차 정규화
    부분함수 종속성 제거를 위해 분리한다.
    고객테이블 회원번호 (PK), 고객이름 연락처
    상품테이블 상품번호 (PK), 상품이름 가격
    주문테이블 거래번호(PK), 회원번호(FK), 상품번호(FK) ,수량, 배송지
    
    3차 정규화는 필요 없음
